init-05-org.org
# TITLE: init-05-org
# DATE: <2016-06-19 Sun>
#+AUTHOR: rthoma
#+STARTUP: indent
#+STARTUP: content
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div

* This is a test of using org mode to document my config files
** Basic header and use-package declaration. 
Ensure org mode is installed. Use the GNU ELPA repository by default.
Explicitly defer loading org mode until it's needed. The ~:mode~ and ~:bind~
specifications imply this already.

 #+begin_src emacs-lisp :tangle yes :padline no
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; init-05-org.el
;; Emacs, Version 24.5
;; Windows 10 Pro, Version 1511
;; Last edited: June 21, 2016
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; org setup
;;
(use-package org
  ;;
  ;; Package preferences
  ;;
  :ensure t
  :pin gnu
  :defer t
 #+end_src

** Probably insert some comments here or something

 #+begin_src emacs-lisp :tangle yes :padline no
  ;;
  ;; Preload initialization
  ;;
  :mode ("\\.org\\'" . org-mode)
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c c" . org-capture)
         ("C-c b" . org-iswitchb))
  ;;
 #+end_src

** Now talk about this stuff

 #+begin_src emacs-lisp :tangle yes :padline no
  :init
  (progn
    (setq org-directory "~/.emacs.d/orgfiles/"
          org-archive-location "~/.emacs.d/orgfiles/archive/")
    (setq org-todo-keywords
          '((sequence "TODO" "WAIT" "CANC" "DONE")))
    (setq org-todo-keyword-faces
          '(("TODO" . org-todo) ("WAIT" . (:foreground "#F2E1AC" :weight bold))
            ("CANC" . org-todo) ("DONE" . org-done)))
    (setq user-full-name "rthoma")
    (setq org-src-preserve-indentation t))
 #+end_src

** After load configuration currently empty

 #+begin_src emacs-lisp :tangle yes :padline no
  ;;
  ;; After load configuration
  ;;
  ;; :config
  ;; (progn ;; config stuff)
  )

;; eof
 #+end_src

# eof
